tap 'caskroom/cask'
tap 'homebrew/brewdler'
tap 'homebrew/dupes'
tap 'homebrew/versions'
brew 'android-platform-tools'
brew 'brew-cask'
brew 'csshx'
brew 'gcc46'
brew 'glib'
brew 'hub'
brew 'lastpass-cli', args: ['with-pinentry']
brew 'rbenv'
brew 'rbenv-bundler'
brew 'reattach-to-user-namespace'
brew 'ruby-build'
brew 'tmux'
brew 'watch'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'thefuck'
brew 'irssi'
brew 'imagemagick'
