# Brew Stuff
tap 'caskroom/cask'
tap 'homebrew/brewdler'
tap 'homebrew/dupes'
tap 'homebrew/versions'
cask 'android-platform-tools'

# Dev Libraries
brew 'gcc46'
brew 'glib'

# Ruby Tools
brew 'rbenv'
brew 'rbenv-bundler'
brew 'ruby-build'
brew 'imagemagick'

# ZSH Tools
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Docker Tools
brew 'docker'
brew 'docker-compose', args: ['without-docker-machine']

# Kubernetes Tools
cask 'minikube'
brew 'docker-machine-driver-xhyve', args: ['without-docker-machine']
brew 'kops'
brew 'kubernetes-cli'

# CLI Tools
brew 'csshx'
brew 'hub'
brew 'lastpass-cli', args: ['with-pinentry']
brew 'reattach-to-user-namespace'
brew 'thefuck'
brew 'tmux'
brew 'watch'
brew 'wget'

# AWS Tools
brew 'awscli'
brew 'aws-shell'

# Go Tools
brew 'go'
brew 'godep'

# Vim
brew 'vim'

# GUI Tools
cask 'slack'
